package Lesson1;

public class HomeWork {
    //1.Создать пустой проект в IntelliJ IDEA и прописать метод main().

    public static void main(String[] args) {

        //2. Создать переменные всех пройденных типов данных и инициализировать их значения.
        byte b = 127; // 8-битное знаковое целое число от -128 до 127
        short st = 3453; // 16-битное знаковое целое число от -32768 до 32767
        int integer = 77; // 32-битное знаковое целое число от -2147483648 до 2147483647
        long lg = 4234235L; // 64-битное знаковое целое число от -9223372036854775808 до 9223372036854775807
        float fl = 31.445f; // 32-битное знаковое число с плавающей запятой одинарной точности
        double dl = 5343.54342; //64-битное знаковое число с плавающей запятой двойной точности
        char ch = 'K'; // 16-битный тип данных, предназначенный для хранения символов в кодировке Unicode
        boolean bool = true; // логический тип данных false, true

        System.out.println(calculate(4,6,7,3));
        isPositiveOrNegative(6);
        years(4);
        greetings ("Evgeniy");
        System.out.println(isNegative(-6));
        System.out.println(task10and20(3,9));
    }

    //3.Написать метод вычисляющий выражение a * (b + (c / d)) и возвращающий результат, где a, b, c, d – аргументы этого метода, имеющие тип float.

    public static float calculate(float a, float b, float c, float d) {
        return a * (b + (c / d));
    }
//4.Написать метод, принимающий на вход два целых числа и проверяющий, что их сумма лежит в пределах от 10 до 20 (включительно), если да – вернуть true, в противном случае – false.

    public static boolean task10and20(int x1, int x2) {
        int sum = x1 + x2;
        if (sum > 10 && sum < 20) {
            return true;
        } else {
            return false;
        }
    }

    //    5.Написать метод, которому в качестве параметра передается целое число, метод должен напечатать в консоль, положительное ли число передали или отрицательное. Замечание: ноль считаем положительным числом.
    public static void isPositiveOrNegative(int x) {
        if (x >= 0) {
            System.out.println("Число " + x + " Положительное");
        } else {
            System.out.println("Число" + x + "Отрицательное");
        }
    }

    //6.Написать метод, которому в качестве параметра передается целое число. Метод должен вернуть true, если число отрицательное, и вернуть false если положительное.
    public static boolean isNegative(int x) {
        if (x < 0) {
            return true;
        }
        return false;
    }

    //7.Написать метод, которому в качестве параметра передается строка, обозначающая имя. Метод должен вывести в консоль сообщение «Привет, указанное_имя!».
    public static void greetings(String name) {
        System.out.println("Привет," + name + "!");
    }

    //8.*Написать метод, который определяет, является ли год високосным, и выводит сообщение в консоль. Каждый 4-й год является високосным, кроме каждого 100-го, при этом каждый 400-й – високосный.
    public static void years(int y) {
        if (y % 4 == 0 && y % 100 != 0 || y % 400 == 0) {
            System.out.println(y + " Год високосный");
        } else {
            System.out.println(y + " Год не високосный");
        }
    }
}
